#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

kubernetes_namespace.spotify_ultimate_recap: Refreshing state... [id=spotify-ultimate-recap]
data.kubernetes_namespace.chbrx: Reading...
module.action_runners.data.kubernetes_namespace.actions_runner_system: Reading...
module.action_runners.data.kubernetes_namespace.actions_runner_system: Read complete after 1s [id=actions-runner-system]
data.kubernetes_namespace.chbrx: Read complete after 1s [id=chbrx]
data.kubernetes_secret.image_pull: Reading...
data.kubernetes_secret.image_pull: Read complete after 1s [id=chbrx/ghcr-creds]
module.database.kubernetes_service.postgres: Refreshing state... [id=spotify-ultimate-recap/spotify-ultimate-recap-postgres]
module.app.kubernetes_secret.app_env: Refreshing state... [id=spotify-ultimate-recap/app-env]
module.database.kubernetes_stateful_set.postgres: Refreshing state... [id=spotify-ultimate-recap/spotify-ultimate-recap-postgres]
module.app.kubernetes_job.db_migration: Refreshing state... [id=spotify-ultimate-recap/spotify-ultimate-recap-db-migration]
module.app.kubernetes_deployment.app: Refreshing state... [id=spotify-ultimate-recap/spotify-ultimate-recap-app]
module.action_runners.kubernetes_manifest.runner_deployment: Refreshing state...
module.action_runners.kubernetes_manifest.runner_autoscaler: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.kubernetes_deployment.app is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "app" {
      ~ id               = "spotify-ultimate-recap/spotify-ultimate-recap-app" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          - labels           = {} -> null
            name             = "spotify-ultimate-recap-app"
          ~ resource_version = "2213856" -> (known after apply)
          ~ uid              = "701d36ca-8eee-4147-8675-9d83114386b6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (12 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "Always" -> (known after apply)
                        name                       = "app"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (6 unchanged attributes hidden)

                      ~ env_from {
                            # (1 unchanged attribute hidden)

                          ~ secret_ref {
                                name     = "app-env"
                              - optional = false -> null
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            name           = null
                            # (3 unchanged attributes hidden)
                        }

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (3 unchanged blocks hidden)
                    }

                  ~ readiness_gate (known after apply)

                    # (1 unchanged block hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.app.kubernetes_ingress_v1.app_ingress will be created
  + resource "kubernetes_ingress_v1" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer"                 = "letsencrypt-production"
              + "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
              + "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
              + "nginx.ingress.kubernetes.io/proxy-body-size"    = "10m"
              + "nginx.ingress.kubernetes.io/proxy-read-timeout" = "60"
              + "nginx.ingress.kubernetes.io/proxy-send-timeout" = "60"
              + "nginx.ingress.kubernetes.io/ssl-redirect"       = "true"
            }
          + generation       = (known after apply)
          + name             = "spotify-ultimate-recap-app-ingress"
          + namespace        = "spotify-ultimate-recap"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "spotify-ultimate-recap.chbrx.com"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "spotify-ultimate-recap-app"

                              + port {
                                  + number = 4321
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "spotify-ultimate-recap.chbrx.com",
                ]
              + secret_name = "spotify-ultimate-recap-cert"
            }
        }
    }

  # module.app.kubernetes_secret.app_env will be updated in-place
  ~ resource "kubernetes_secret" "app_env" {
      ~ data                           = (sensitive value)
        id                             = "spotify-ultimate-recap/app-env"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app.kubernetes_service.app will be created
  + resource "kubernetes_service" "app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "spotify-ultimate-recap-app"
          + namespace        = "spotify-ultimate-recap"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "spotify-ultimate-recap-app"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 4321
              + protocol    = "TCP"
              + target_port = "4321"
            }

          + session_affinity_config (known after apply)
        }
    }

  # module.database.kubernetes_stateful_set.postgres will be updated in-place
  ~ resource "kubernetes_stateful_set" "postgres" {
        id               = "spotify-ultimate-recap/spotify-ultimate-recap-postgres"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {
              ~ spec {
                    # (18 unchanged attributes hidden)

                  ~ container {
                        name                       = "postgres"
                        # (10 unchanged attributes hidden)

                      ~ env {
                            name  = "POSTGRES_USER"
                          ~ value = (sensitive value)
                        }
                      ~ env {
                            name  = "POSTGRES_PASSWORD"
                          ~ value = (sensitive value)
                        }

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ exec {
                              ~ command = [
                                    # (1 unchanged element hidden)
                                    "-U",
                                  ~ (sensitive value),
                                    "-d",
                                    # (1 unchanged element hidden)
                                ]
                            }
                        }

                      ~ readiness_probe {
                            # (5 unchanged attributes hidden)

                          ~ exec {
                              ~ command = [
                                    # (1 unchanged element hidden)
                                    "-U",
                                  ~ (sensitive value),
                                    "-d",
                                    # (1 unchanged element hidden)
                                ]
                            }
                        }

                        # (5 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Loic-Vanden-Bossche, Action: `pull_request`*